---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuildingPadType
source: html/e4d7aa0f-7f82-91f9-a3bb-81aa92d0bef0.htm
---
# BuildingPadType Properties

The id of the assembly instance to which the element belongs.